[
  "Never have I ever pretended to be bad at something to get someone to “teach” me.",
  "Never have I ever flirted with someone I knew was already taken.",
  "Never have I kissed someone within an hour of meeting them.",
  "Never have I ever kissed more than one person in a single night.",
  "Never have I ever kissed someone just to make someone else jealous.",
  "Never have I ever had a crush on a friend and acted on it.",
  "Never have I ever sent a bold “I miss you” message late at night.",
  "Never have I ever sent a suggestive selfie.",
  "Never have I ever wanted someone just because they were hard to get.",
  "Never have I ever felt jealous about someone’s ex.",
  "Never have I ever gone on a secret date without telling anyone.",
  "Never have I ever knowingly led someone on.",
  "Never have I ever liked two people at the same time.",
  "Never have I ever run into an ex on a date.",
  "Never have I ever left something behind just as an excuse to go back.",
  "Never have I ever intentionally worn something daring for someone.",
  "Never have I ever teased someone just because I liked how they reacted.",
  "Never have I ever been told I was a good kisser.",
  "极 have I ever made out in public.",
  "Never have I ever kissed someone and not known their name.",
  "Never have I ever gone skinny-dipping with someone.",
  "Never have I ever had a flirty moment in a hot tub.",
  "Never have I ever kissed someone who was “off-limits.”",
  "Never have I ever sent a message that I hoped would make someone blush.",
  "Never have I ever left a party to go somewhere more private with someone.",
  "Never have I ever been called out for being too flirty.",
  "Never have I ever kissed someone somewhere unexpected.",
  "Never have I ever let someone kiss me somewhere other than my lips in public.",
  "Never have I ever received a text that made me blush in public.",
  "Never have I ever kissed someone in a way that made me feel dizzy.",
  "Never have I ever gotten a hickey.",
  "Never have I ever given someone a hickey.",
  "Never have I ever gone farther than kissing in a car.",
  "Never have I ever had a crush on someone else while in a relationship.",
  "Never have I ever danced provocatively in front of someone.",
  "Never have I ever worn a complete set of lingerie.",
  "Never have I ever been caught in a compromising position.",
  "Never have I ever had a makeout session turn into something more while others were in earshot.",
  "Never have I ever sent a flirty text to the wrong person and rolled with it.",
  "Never have I ever sent a suggestive text to someone I was in the same room with.",
  "Never have I ever used a vibrator.",
  "Never have I ever had a sex dream about someone in this room.",
  "Never have I ever had a crush on someone a friend was dating.",
  "Never have I ever had a friends-with-benefits dynamic.",
  "Never have I ever made a sexy playlist.",
  "Never have I ever had a terrible first kiss with someone.",
  "Never have I ever had a favorite movie sex scene.",
  "Never have I ever engaged in any kind of butt play.",
  "Never have I ever listened to audio erotica.",
  "Never have I ever tried something in the bedroom that I saw in a movie.",
  "Never have I ever flirted to get something I wanted.",
  "Never have I ever let someone take the lead in the bedroom when I normally wouldn’t.",
  "Never have I ever made out with someone in a place I wasn’t supposed to be.",
  "Never have I ever had an unexpected “almost” moment with someone.",
  "Never have I ever broken the “no kissing on the first date” rule.",
  "Never have I ever gotten someone’s number just to see if I could get it.",
  "Never have I ever hooked up with an ex.",
  "Never have I ever hooked up with a friend.",
  "Never have I ever hooked up with someone I had no intention of ever seeing again.",
  "Never have I ever hooked up with a coworker.",
  "Never have I ever tried to avoid someone I hooked up with.",
  "Never have I ever had a rebound fling.",
  "Never have I ever hooked up with someone I met while traveling.",
  "Never have I ever had a secret crush for more than a month.",
  "Never have I ever been the one to ask a crush out.",
  "Never have I ever had a crush on a friend.",
  "Never have I ever had a crush on someone I worked with.",
  "Never have I ever flirted with someone just to make my crush jealous.",
  "Never have I ever had a crush on someone’s ex.",
  "Never have I ever accidentally texted a crush the wrong message.",
  "Never have I ever decided a crush couldn’t work out because of their zodiac sign.",
  "Never have I ever had a crush on someone older than me.",
  "Never have I ever had a crush on someone younger than me.",
  "Never have I ever had a crush on someone I met online.",
  "Never have I ever had a crush on someone who already had a partner.",
  "Never have I ever had a crush on a person from my past.",
  "Never have I ever gotten caught staring at my crush.",
  "Never have I ever sent my crush a text and regretted it.",
  "Never have I ever liked someone before they liked me back.",
  "Never have I ever made a crush a playlist.",
  "Never have I ever tried to be friends with my crush to get closer to them.",
  "Never have I ever used a friend to get a crush to talk to me.",
  "Never have I ever picked up a new hobby only to impress a crush.",
  "Never have I ever had a crush on someone my friends didn’t approve of.",
  "Never have I ever had a crush on someone I knew I’d never be with.",
  "Never have I ever had a crush on an Aquarius.",
  "Never have I ever had a crush on a Pisces.",
  "Never have I ever had a crush on an Aries.",
  "Never have I ever had a crush on a Taurus.",
  "Never have I ever had a crush on a Gemini.",
  "Never have I ever had a crush on a Cancer.",
  "Never have I ever had a crush on a Leo.",
  "Never have I ever had a crush on a Virgo.",
  "Never have I ever had a crush on a Libra.",
  "Never have I ever had a crush on a Scorpio.",
  "Never have I ever had a crush on a Sagittarius.",
  "Never have I ever had a crush on a Capricorn.",
  "Never have I ever lost sleep over a crush.",
  "Never have I ever accidentally liked something from a long time ago on a crush’s social media page.",
  "Never have I ever changed my plans just to be where my crush was.",
  "Never have I ever posted something on social media specifically to get my crush’s attention.",
  "Never have I ever intentionally played hard to get with my crush.",
  "Never have I ever social media stalked a crush’s exes.",
  "Never have I ever saved screenshots of my crush’s texts.",
  "Never have I ever sent a crush a “you up?” text.",
  "Never have I ever fantasized about kissing someone I’m playing this game with.",
  "Never have I ever Googled someone before a date.",
  "Never have I ever lied about something on a date to seem more interesting.",
  "Never have I ever accidentally called someone the wrong name on a date.",
  "Never have I ever ordered something awkward to eat (like spaghetti) on a date.",
  "Never have I ever dated someone only for their looks.",
  "Never have I ever been more than 30 minutes late to a date.",
  "Never have I ever left in the middle of a date.",
  "Never have I ever used a cheesy pick-up line that surprisingly worked.",
  "Never have I ever waited hours to reply to a text just to seem busy.",
  "Never have I ever pretended not to care when I was actually really into someone.",
  "Never have I ever planned a date that went completely wrong.",
  "Never have I ever canceled plans with friends for a date.",
  "Never have I ever gone on a date just for the food.",
  "Never have I ever been on a date that felt like it belonged in a movie.",
  "Never have I ever taken multiple different dates to the same spot.",
  "Never have I ever celebrated a monthiversary.",
  "Never have I ever met an S.O.’s family.",
  "Never have I ever taken a vacation with someone within a month of meeting them.",
  "Never have I ever pictured what our kids would like with a partner.",
  "Never have I ever used a pet name for a partner.",
  "Never have I ever thought about what song would be “our” song with an S.O.",
  "Never have I ever been scared to tell someone how I really felt.",
  "Never have I ever disliked a partner’s friends.",
  "Never have I ever pictured myself marrying someone.",
  "Never have I ever dated someone because I was bored.",
  "Never have I ever said “I love you” first.",
  "Never have I ever said “I love you” without being sure I meant it.",
  "Never have I ever been swept off my feet.",
  "Never have I ever felt like someone’s touch was electric.",
  "Never have I ever told myself I could fix someone.",
  "Never have I ever imagined being old with someone.",
  "Never have I ever felt I let someone get away.",
  "Never have I ever had my heart broken.",
  "Never have I ever broken someone else’s heart.",
  "Never have I ever loved someone I knew wasn’t good for me.",
  "Never have I ever gotten back together with an ex.",
  "Never have I ever fantasized about getting back together with an ex.",
  "Never have I ever been in love.",
  "Never have I ever had a friend with benefits.",
   "Never have I ever had multiple orgasms in a row.",
    "Never have I ever gone skinny dipping.",
    "Never have I ever eaten ass.",
    "Never have I ever showered with another person.",
    "Never have I ever had phone sex.",
    "Never have I ever given head.",
    "Never have I ever received head.",
    "Never have I ever had a sugar mama or sugar daddy.",
    "Never have I ever spit in someone else's mouth or let someone spit in my mouth.",
    "Never have I ever been tied up or tied someone up in bed.",
    "Never have I ever gone streaking.",
    "Never have I ever used a sex toy with a partner.",
    "Never have I ever participated in an orgy.",
    "Never have I ever faked an orgasm.",
    "Never have I ever played strip poker.",
    "Never have I ever had sex in a club.",
    "Never have I ever had a finger up my bum.",
    "Never have I ever been fingered or fingered someone in a movie theater.",
    "Never have I ever given or received a hickey.",
    "Never have I ever been handcuffed or handcuffed somebody.",
    "Never have I ever hooked up with someone 10 or more years older than me.",
    "Never have I ever slept with a model.",
    "Never have I ever joined the mile-high club.",
    "Never have I ever sold feet pics/used underwear.",
    "Never have I ever had a one night stand during the pandemic.",
    "Never have I ever given a handjob.",
    "Never have I ever hooked up with one of my friend's siblings.",
    "Never have I ever let someone come on my face.",
    "Never have I ever had sex while high on weed.",
    "Never have I ever come on someone's face.",
    "Never have I ever been walked in on while having sex.",
    "Never have I ever had an open or polyamorous relationship.",
    "Never have I ever catfished someone.",
    "Never have I ever had sex with someone of the same gender.",
    "Never have I ever had sex with somebody I wasn't attracted to.",
    "Never have I ever used a dirty pickup line.",
    "Never have I ever had sex while on drugs.",
    "Never have I ever had sex in a pool.",
    "Never have I ever had sex in a public place while other people watched.",
    "Never have I ever thrown up during sex.",
    "Never have I ever motorboated someone.",
    "Never have I ever been motorboated.",
    "Never have I ever had sex while somebody else was in the room.",
    "Never have I ever made an OnlyFans.",
    "Never have I ever had sex in my parents' bed.",
    "Never have I ever had sex at a park.",
    "Never have I ever used a dating app for the sole purpose of hooking up with somebody.",
    "Never have I ever filmed myself masturbating.",
    "Never have I ever sent a sext to the wrong person.",
    "Never have I ever said \"I love you\" during sex.",
    "Never have I ever watched porn with a partner.",
    "Never have I ever sexted multiple people at the same time.",
    "Never have I ever had sex with a partner that I wasn't in a relationship with and not used protection.",
    "Never have I ever taken a morning-after pill.",
    "Never have I ever slept with a boss.",
    "Never have I ever slid into someone's DMs to have sex.",
    "Never have I ever ghosted someone after sex.",
    "Never have I ever cried during or after sex.",
    "Never have I ever had my ass ate.",
    "Never have I ever given or received a golden shower.",
    "Never have I ever been to a nude beach.",
    "Never have I ever slept with a colleague.",
    "Never have I ever had a “no strings attached” sexual relationship.",
    "Never have I ever had sex in a public place.",
    "Never have I ever swapped partners with someone else.",
    "Never have I ever French kissed someone.",
    "Never have I ever uploaded or livestreamed a video of myself having sex over the internet, either solo or with another person.",
    "Never have I ever made a sex tape, either with a partner or solo.",
    "Never have I ever caught my parents having sex.",
    "Never have I ever cheated on a significant other.",
    "Never have I ever uploaded my nude photos on an online public forum or a porn site.",
    "Never have I ever sent nudes.",
    "Never have I ever had sex in my parents' house.",
    "Never have I ever tried double penetration.",
    "Never have I ever had sex with someone and realized that I'd forgotten their name.",
    "Never have I ever hooked up with two different people on the same day.",
    "Never have I ever slept with somebody who had a partner I didn't personally know.",
    "Never have I ever hooked up with a friend.",
    "Never have I ever had a threesome or other group sex.",
    "Never have I ever gone on a blind date.",
    "Never have I ever slept with somebody who had a partner I DID personally know.",
    "Never have I ever swallowed someone's sperm.",
    "Never have I ever had sex with someone the same day I met them.",
    "Never have I ever masturbated more than twice in one day.",
    "Never have I ever had a sexual dream about someone I know personally, that's not my S.O.",
    "Never have I ever used food during sex.",
    "Never have I ever tried a sex swing.",
    "Never have I ever fallen asleep during sex.",
    "Never have I ever kissed someone.",
    "Never have I ever been swept off my feet.",
    "Never have I ever fallen in love at first sight.",
    "Never have I ever been on a blind date.",
    "Never have I ever called a partner an ex’s name.",
    "Never have I ever pretended a reason to leave a date.",
    "Never have I ever had a one-night stand.",
    "Never have I ever accidentally said I love you to someone.",
    "Never have I ever used a dating app.",
    "Never have I ever gone on more than one date in one day.",
    "Never have I ever slept with someone on a first date.",
    "Never have I ever used food during sex.",
    "Never have I ever faked an orgasm.",
    "Never have I ever been skinny dipping.",
    "Never have I ever had sex with someone in public.",
    "Never have I ever had sex with someone in a car.",
    "Never have I ever kissed someone in public.",
    "Never have I ever kissed more than 1 person in 24 hours.",
    "Never have I ever sent a dirty text.",
    "Never have I ever sent a dirty text to the wrong person.",
    "Never have I ever watched porn.",
    "Never have I ever gone down on someone in a cinema.",
    "Never have I ever flashed someone.",
    "Never have I ever given a lap dance.",
    "Never have I ever received a lap dance.",
    "Never have I ever slept with a co-worker.",
    "Never have I ever been nude in public.",
    "Never have I ever had a threesome.",
    "Never have I ever had a friends-with-benefits arrangement.",
    "Never have I ever done a sexy roleplay.",
    "Never have I ever worn someone else’s underwear.",
    "Never have I ever sent a stranger a drink.",
    "Never have I ever been to a strip club.",
    "Never have I ever gone commando.",
    "Never have I ever played strip poker.",
    "Never have I ever been given a hickey.",
    "Never have I ever used handcuffs or toys.",
    "Never have I ever had sex with someone more than 10 years older than me.",
    "Never have I ever had sex with someone more than 5 years younger than me.",
    "Never have I ever peed in the shower or pool.",
    "Never have I ever not washed my hands after taking a dump.",
    "Never have I ever gotten a speeding ticket.",
    "Never have I ever been caught picking my nose and eating it.",
    "Never have I ever drunk-dialled someone.",
    "Never have I ever laughed so hard that I peed.",
    "Never have I ever blamed a fart on a pet.",
    "Never have I ever had a negative bank balance.",
    "Never have I ever been arrested.",
    "Never have I ever stolen anything.",
    "Never have I ever wet the bed as an adult.",
    "Never have I ever walked in on my parents.",
    "Never have I ever clogged a toilet.",
    "Never have I ever worn something out of the dirty laundry.",
    "Never have I ever eaten someone else’s lunch in the work fridge.",
    "Never have I ever fallen asleep at work.",
    "Never have I ever lied on my resume.",
    "Never have I ever thought a friend’s baby was ugly.",
    "Never have I ever eaten insects.",
    "Never have I ever re-gifted something.",
    "Never have I ever flirted with a married person.",
     "Never have I ever…undressed someone with my eyes.",
    "Never have I ever…fantasized about a stranger I saw just once.",
    "Never have I ever…sent my partner a spicy picture while they were at a work meeting.",
    "Never have I ever…secretly enjoyed a forbidden encounter in a public place.",
    "Never have I ever…hooked up with someone without them knowing my real name.",
    "Never have I ever…had a friend with benefits.",
    "Never have I ever…been with a sugar mama or sugar daddy.",
    "Never have I ever…joined OnlyFans.",
    "Never have I ever…texted someone something scandalous while they were at a family dinner.",
    "Never have I ever…undressed while my partner was in a Zoom meeting.",
    "Never have I ever…acted shy in the bedroom.",
    "Never have I ever…said “I love you” just to hook up with someone.",
    "Never have I ever…had a rebound hookup.",
    "Never have I ever…gotten a bedroom-related injury.",
    "Never have I ever…bought a Playboy.",
    "Never have I ever…watched Game of Thrones just for the steamy scenes.",
    "Never have I ever…had a one-night stand.",
    "Never have I ever…had a dirty dream about someone very unexpected while I was dating someone else.",
    "Never have I ever…gifted my partner something naughty.",
    "Never have I ever…hooked up with someone to make someone else jealous.",
    "Never have I ever…used a spicy pickup line on someone.",
    "Never have I ever…wined and dined with someone I really liked.",
    "Never have I ever…locked eyes with someone across a crowded room and made them blush.",
    "Never have I ever…worn a low-cut top to get the attention of someone.",
    "Never have I ever…made someone’s fantasy come true.",
    "Never have I ever…serenaded a person I liked.",
    "Never have I ever…showed up somewhere hoping to run into my crush.",
    "Never have I ever…given someone a full body massage.",
    "Never have I ever…planned a romantic evening for someone.",
    "Never have I ever…written a love letter to someone.",
    "Never have I ever…bragged about my crush to my friends.",
    "Never have I ever…surprised someone with concert tickets.",
    "Never have I ever…cooked someone a romantic meal at home.",
    "Never have I ever…danced under the stars with my crush.",
    "Never have I ever…swept someone off their feet.",
    "Never have I ever…taken a redeye so I could be in attendance at something my crush was doing.",
    "Never have I ever…made out with someone for an hour.",
    "Never have I ever…had a movie-like romance.",
    "Never have I ever…said something to make my crush blush in a good way.",
    "Never have I ever…Googled how to talk dirty to someone.",
    "Never have I ever…hooked up with a coworker.",
    "Never have I ever…stalked someone on social media.",
    "Never have I ever…used my partner’s toothbrush without telling them.",
    "Never have I ever…used my ex’s Netflix account.",
    "Never have I ever…gone on a blind date.",
    "Never have I ever…kissed someone in the rain.",
    "Never have I ever…been on a romantic getaway.",
    "Never have I ever…left work early to go on a date.",
    "Never have I ever…stayed up all night texting someone.",
    "Never have I ever…kissed a frog and wished to meet my person.",
    "Never have I ever…applied for a job at a company where my crush worked.",
    "Never have I ever…accidentally left something with my crush so they’d have to return it to me.",
    "Never have I ever…dreamt about marrying someone I just met.",
    "Never have I ever…played footsie.",
    "Never have I ever…read dating books.",
    "Never have I ever…drove over two hours to see someone I liked.",
    "Never have I ever…talked in my sleep.",
    "Never have I ever…made up a Finstagram to check out my crush’s profile.",
    "Never have I ever…crashed my partner’s car.",
    "Never have I ever…been cheated on.",
    "Never have I ever…tripped in front of my crush.",
    "Never have I ever…invited my crush to a scary movie just for the chance to cuddle.",
    "Never have I ever…played a thumb war game just to hold someone’s hand I liked.",
    "Never have I ever…went to the gym to try to meet someone.",
    "Never have I ever…been engaged before.",
    "Never have I ever…dated multiple people at once.",
    "Never have I ever…given someone a foot massage.",
    "Never have I ever…let my parents set me up with someone.",
    "Never have I ever…lied to a partner about where I was going.",
    "Never have I ever…snuck into the movies with someone.",
    "Never have I ever…learned something to impress someone.",
    "Never have I ever…fallen asleep on the phone with someone.",
    "Never have I ever…shoplifted with a partner.",
    "Never have I ever…regretted a tattoo.",
    "Never have I ever…drunk-texted my ex.",
    "Never have I ever…spent too much money on a gift for a crush.",
    "Never have I ever…played Dirty Truth or Dare.",
    "Never have I ever…told a dirty joke.",
    "Never have I ever…read a spicy romance book.",
    "Never have I ever…eaten off my crush’s plate.",
    "Never have I ever…sang in public to impress someone.",
    "Never have I ever…traveled to a foreign country to meet someone.",
    "Never have I ever…learned another language for someone.",
    "Never have I ever…convinced a friend to dump someone.",
    "Never have I ever…been a maid of honor/best man in a wedding.",
    "Never have I ever…gambled with a partner.",
    "Never have I ever…lied about my age.",
    "Never have I ever…revealed someone’s secret boyfriend or girlfriend.",
    "Never have I ever…looked at a dating app while in a relationship.",
    "Never have I ever…wanted a spicy nickname.",
    "Never have I ever…wanted to dance together at a crowded party.",
    "Never have I ever…wanted to go skinny dipping.",
    "Never have I ever…fantasized about you during the day.",
    "Never have I ever…wanted to try something new in the bedroom.",
    "Never have I ever…walked around in just my undergarments all day in my house.",
    "Never have I ever…cooked in the nude.",
    "Never have I ever…desired to do nude yoga.",
    "Never have I ever…wanted to hook up in a tent.",
    "Never have I ever…wanted to leave a party early together.",
    "Never have I ever…wanted to eat breakfast in bed without getting dressed.",
    "Never have I ever…wanted to be kissed from my head down to my toes.",
    "Never have I ever…wanted to role-play.",
    "Never have I ever…checked you out without you realizing it.",
    "Never have I ever…taken a spicy photo of you without you knowing it.",
    "Never have I ever…taken spicy photos of myself.",
    "Never have I ever…wanted to reenact moments from 50 Shades of Grey.",
    "Never have I ever…gotten jealous while we’ve been together.",
    "Never have I ever…stared at how good your butt looks in jeans.",
    "Never have I ever…daydreamed you were in Magic Mike.",
    "Never have I ever…bought something spicy to wear.",
    "Never have I ever…made a spicy playlist.",
    "Never have I ever…sent a spicy text to someone while I’ve been at work.",
    "Never have I ever…lost a “sexy bet” with someone.",
    "Never have I ever…been caught hooking up with someone.",
    "Never have I ever…made out with a stranger.",
    "Never have I ever…daydreamed about how someone would look nude.",
    "Never have I ever…gotten criticized for my dating history.",
    "Never have I ever…made out with a friend.",
    "Never have I ever…had a quickie.",
    "Never have I ever…Netflixed and chilled.",
    "Never have I ever…broken the dress code at work.",
    "Never have I ever…sold feet pics for money.",
    "Never have I ever…stuffed my bra.",
    "Never have I ever…flirted with someone who was taken.",
    "Never have I ever…read a whole dirty romance series.",
    "Never have I ever…convinced my partner to reenact steamy scenes from Bridgerton.",
    "Never have I ever…taken boudoir photos.",
    "Never have I ever…lied about my past romantic experiences.",
    "Never have I ever…gone braless to work.",
    "Never have I ever…taken a shower with the door open.",
    "Never have I ever…done a striptease.",
    "Never have I ever…worn edible clothing.",
    "Never have I ever…hooked up with a groomsman at a wedding.",
    "Never have I ever…seen someone nude by mistake.",
    "Never have I ever…taken a bath with someone else.",
    "Never have I ever…gone to a strip club.",
    "Never have I ever…hooked up with someone famous.",
    "Never have I ever…played strip poker.",
    "Never have I ever…farted while hooking up with someone.",
    "Never have I ever…wished I was Penelope Featherington during the carriage scene in Bridgerton.",
    "Never have I ever…been with someone younger.",
    "Never have I ever…kissed a friend’s sibling.",
    "Never have I ever…dated someone just to make someone else jealous.",
    "Never have I ever…had a wardrobe malfunction in public.",
    "Never have I ever…given a lap dance.",
    "Never have I ever…gone commando during the day.",
    "Never have I ever…sent a spicy text to the wrong person.",
    "Never have I ever…dated a friend’s ex.",
    "Never have I ever…flirted with my boss.",
    "Never have I ever…flirted with a friend.",
    "Never have I ever…edited my selfies on my dating profile.",
    "Never have I ever…gifted lingerie to someone.",
    "Never have I ever…woken up next to a stranger.",
    "Never have I ever…winked at someone.",
    "Never have I ever…flirted my way out of trouble.",
    "Never have I ever…kissed a sibling’s friend.",
    "Never have I ever…showered with someone.",
    "Never have I ever…been caught looking at something naughty.",
    "Never have I ever…modeled nude.",
    "Never have I ever…hooked up with more than one person in a day.",
    "Never have I ever…joined the mile high club.",
    "Never have I ever…hooked up with someone in a hot tub.",
    "Never have I ever…had a steamy dream about a friend.",
    "Never have I ever…taken a shower selfie.",
    "Never have I ever…lied on my dating profile.",
    "Never have I ever…been attracted to a cartoon character.",
    "Never have I ever…flashed someone in public.",
    "Never have I ever…shared the same piece of gum with someone.",
    "Never have I ever…realized I have a “type.”",
    "Never have I ever…slept with an ex.",
    "Never have I ever…hooked up with someone in a friend’s bed.",
    "Never have I ever…responded to a booty call.",
    "Never have I ever…been to a nude beach.",
    "Never have I ever…hid a love bite.",
    "Never have I ever…lied about my looks.",
     "Never have I ever had sex in a public place.",
    "Never have I ever been handcuffed during sex.",
    "Never have I ever had a one-night stand.",
    "Never have I ever sent a nude to someone.",
    "Never have I ever had a threesome.",
    "Never have I ever hooked up with someone I just met.",
    "Never have I ever had sex with a friend’s ex.",
    "Never have I ever used a sex toy during sex.",
    "Never have I ever faked an orgasm.",
    "Never have I ever had phone sex.",
    "Never have I ever been caught masturbating.",
    "Never have I ever had sex in a car.",
    "Never have I ever had sex with someone twice my age.",
    "Never have I ever had sex in a hotel room.",
    "Never have I ever had a crush on someone in this room.",
    "Never have I ever had sex in a hot tub.",
    "Never have I ever used food during sex.",
    "Never have I ever had sex in a public restroom.",
    "Never have I ever cheated on a partner.",
    "Never have I ever had a friends-with-benefits relationship.",
    "Never have I ever had sex with someone I met online.",
    "Never have I ever had sex in a pool.",
    "Never have I ever had sex while someone else was watching.",
    "Never have I ever had a threesome with my partner and someone else.",
    "Never have I ever role-played during sex.",
    "Never have I ever kissed someone after the first date.",
    "Never have I ever lied about my age to someone I was attracted to.",
    "Never have I ever had a crush on a friend’s significant other.",
    "Never have I ever flirted with someone to get what I wanted.",
    "Never have I ever gone skinny dipping with someone.",
    "Never have I ever made out with someone in a public place.",
    "Never have I ever had a secret admirer.",
    "Never have I ever had sex with someone I didn’t find attractive.",
    "Never have I ever had a passionate kiss in the rain.",
    "Never have I ever fallen in love at first sight.",
    "Never have I ever had a romantic dream about a friend.",
    "Never have I ever lied to someone I was dating about being exclusive.",
    "Never have I ever flirted with someone while in a relationship.",
    "Never have I ever kissed someone I wasn’t dating to make someone else jealous.",
    "Never have I ever had a crush on a teacher or professor.",
    "Never have I ever had a hookup with someone I met on a dating app.",
    "Never have I ever had a romantic encounter with a coworker.",
    "Never have I ever had a crush on someone significantly older than me.",
    "Never have I ever made out with someone while under the influence of alcohol.",
    "Never have I ever fantasized about someone I knew was in a relationship.",
    "Never have I ever kissed someone I regretted immediately afterward.",
    "Never have I ever had a steamy makeout session in a car.",
    "Never have I ever lied about my relationship status to get someone’s attention.",
    "Never have I ever flirted with someone while pretending to be someone else online.",
    "Never have I ever kissed someone and then acted like it never happened.",
    "Never have I ever had sex with more than one person daily.",
    "Never have I ever been part of an orgy.",
    "Never have I ever had sex with a stranger.",
    "Never have I ever had sex with someone older or younger than me.",
    "Never have I ever had sex while watching porn.",
    "Never have I ever had sex in a public restroom.",
    "Never have I ever had sex with a married person.",
    "Never have I ever had sex in a room with other people present.",
    "Never have I ever had sex with someone while their partner was in the same room.",
    "Never have I ever had sex with someone I met at a bar or club.",
    "Never have I ever had sex with a friend’s ex.",
    "Never have I ever had sex with someone while their parents were home.",
    "Never have I ever had sex with someone in a relationship with someone else.",
    "Never have I ever had sex with someone I didn’t know their name.",
    "Never have I ever had sex with a celebrity in my dreams.",
    "Never have I ever used handcuffs or other BDSM tools during sex.",
    "Never have I ever had sex with someone famous or well-known.",
    "Never have I ever had sex in a movie theater.",
    "Never have I ever had sex in a tent or camping.",
    "Never have I ever had sex with someone significantly taller or shorter than me.",
    "Never have I ever had sex in a public park.",
    "Never have I ever had sex on a boat or yacht.",
    "Never have I ever had sex with someone I didn’t speak the same language.",
    "Never have I ever had sex in a sauna or steam room.",
    "Never have I ever had sex with someone who was a virgin.",
    "Never have I ever had sex in a cemetery.",
    "Never have I ever had sex while wearing a costume.",
    "Never have I ever had sex with someone while they were on the phone.",
    "Never have I ever had sex with someone blindfolded or tied up.",
    "Never have I ever had sex with someone who was lactating.",
    "Never have I ever had sex with someone who was menstruating.",
    "Never have I ever had sex with someone in their office.",
    "Never have I ever had sex in a church or other religious setting.",
    "Never have I ever had sex with someone in a dressing room.",
    "Never have I ever had sex in a library.",
    "Never have I ever had sex with someone in an open relationship.",
    "Never have I ever had sex with someone pregnant.",
    "Never have I ever had break-up sex before.",
    "Never have I ever had sex with someone from a different country.",
    "Never have I ever had sex with someone using a strap-on.",
    "Never have I ever been to a glory hole.",
    "Never have I ever visited an adult store.",
    "Never have I ever been to a nude beach.",
    "Never have I ever had sex with someone wearing a chastity belt.",
    "Never have I ever had sex outdoors in the winter.",
    "Never have I ever spat or been spat on during sex.",
    "Never have I ever had sex with someone with a furry costume on.",
    "Never have I ever had sex in a bush.",
    "Never have I ever given or received a lap dance.",
    "Never have I ever attended a sex party."

]